package by.it.vedom.Calculator;

public class VarV extends Var {


    @Override
    public void fromString(String str) {

    }

    /* Насколько понял:
        Переводим строку в массив даблов с помощью матчеров и форматеров (Тема для меня вода водой, даже тут проблемы возникают,
    к тому же использовать регулярки, в них тоже не фонтан).
        Далее уже работать с массивом, сделать операции число(+-*поделить)вектор и вектор(+-*поделить)вектор не составит труда.
        Пытался сделать сплит на строку, включая запятую, но не знаю, можно ли так. str.split(", ").
        Потом вспомнил про фигурную скобку, снова регулярки..
        Проблема именно со строками, нужно разбираться... Возможно, если бы была возможность посетить занятия, проблем было бы меньше.
    */
}