package by.it.dashkevich.jd01_06;


import java.util.ArrayList;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

/**
 * Created by дёня on 06.03.2017.
 */
/* Не сделал сортировку строк от количества слов в ней(((  */
public class TaskB_2 {
    public static void main(String[] args) {
        String text = "У лукоморья дуб зеленый;\n" +
                "Златая цепь на дубе том:\n" +
                "И днем и ночью кот ученый\n" +
                "Всё ходит по цепи кругом;\n" +
                "Идет направо — песнь заводит,\n" +
                "Налево — сказку говорит.\n" +
                "Там чудеса: там леший бродит,\n" +
                "Русалка на ветвях сидит;\n" +
                "Там на неведомых дорожках\n" +
                "Следы невиданных зверей;\n" +
                "Избушка там на курьих ножках\n" +
                "Стоит без окон, без дверей;\n" +
                "Там лес и дол видений полны;\n" +
                "Там о заре прихлынут волны\n" +
                "На брег песчаный и пустой,\n" +
                "И тридцать витязей прекрасных\n" +
                "Чредой из вод выходят ясных,\n" +
                "И с ними дядька их морской;\n" +
                "Там королевич мимоходом\n" +
                "Пленяет грозного царя;\n" +
                "Там в облаках перед народом\n" +
                "Через леса, через моря\n" +
                "Колдун несет богатыря;\n" +
                "В темнице там царевна тужит,\n" +
                "А бурый волк ей верно служит;\n" +
                "Там ступа с Бабою Ягой\n" +
                "Идет, бредет сама собой;\n" +
                "Там царь Кащей над златом чахнет;\n" +
                "Там русской дух... там Русью пахнет!\n" +
                "И там я был, и мед я пил;\n" +
                "У моря видел дуб зеленый;\n" +
                "Под ним сидел, и кот ученый\n" +
                "Свои мне сказки говорил.\n" +
                "Одну я помню: сказку эту\n" +
                "Поведаю теперь я свету...";

        Pattern p1 = Pattern.compile("\\b[А-Яа-яЁё.,:!; —]+(?=\\n?)"); // инструкция нарезки на строки

        Matcher m1 = p1.matcher(text);
        ArrayList<String> array = new ArrayList<>();

        while(m1.find()) {
            array.add(m1.group());  // разбиваем на строики и добавляем их в массив
        }

        for(int i=array.size()-1; i<=0; i--) {
            for(int j=0; j<i; j++) {
                if(compare(array.get(j))<compare(array.get(j+1))) {
                    String s = array.get(j+1);
                    array.add((j+1), array.get(j));
                    array.add(j, s);
                }
            }
        }

        for(String x: array) {
            System.out.println(x);
        }

    }
    static int compare(String x) {
        int i=0;
        Pattern p2 = Pattern.compile("[А-Яа-яЁё]+"); // инструкция для подсчета слов
        Matcher m2 = p2.matcher(x);
        while(m2.find()) i++;
        return i;
    }
}